[{"question": "What is the main purpose of this application?", "context": "Understanding the overall goal of the application is crucial for navigating the codebase and understanding design choices.", "difficulty": "Easy", "companies": ["Startups", "FAANG", "FinTech", "Enterprise"]}, {"question": "How does the repository analysis functionality work? What steps are involved in extracting features and generating questions?", "context": "This question dives into the core logic of the application, focusing on the `repo_utils.py` file and its functions related to analyzing GitHub repositories.", "difficulty": "Medium", "companies": ["Startups", "FAANG"]}, {"question": "What is the primary focus of the Python code examples in this repository (e.g., algorithms, data structures, specific problem-solving techniques)?", "context": "Understanding the overall goal of the codebase helps in navigating and comprehending individual programs.", "difficulty": "Medium", "companies": ["FAANG", "Startups"]}, {"question": "What is the main purpose of this e-commerce application?", "context": "Understanding the core functionality of the application is crucial for navigating the codebase. This question helps establish the overall goal of the application.", "difficulty": "Easy", "companies": ["Retail", "FAANG", "Startups"]}, {"question": "What is the main purpose of this e-commerce application, and what are its core features (e.g., product browsing, purchasing, order management)?", "context": "Understanding the application's goals and functionalities is crucial for navigating the codebase.", "difficulty": "Hard", "companies": ["Startups", "Retail", "FAANG"]}, {"question": "How does the client-side interact with the server-side (e.g., API routes, server actions)?", "context": "This clarifies the application's architecture and how data fetching and mutations are handled.  The code uses server components and actions.", "difficulty": "Medium", "companies": ["FAANG", "Enterprise", "Startups", "FinTech"]}, {"question": "How does the routing work in this application, considering both client-side navigation with NavLink and server-side routing with Next.js routes?", "context": "The application uses both client-side and server-side routing, and understanding how these interact is important for working with navigation and data fetching.", "difficulty": "Hard", "companies": ["Startups", "FAANG"]}]